#+title: Refactor, build, finalize, and done.
#+date: <2023-03-22 09:57>
#+description: Almost done! Time to clean things up
#+filetags: Gerbil MuKn state-channels

** Gerbil master to local branch

We already have it as a remote

#+begin_src bash :session refactor-shell
  git remote -v
#+end_src
=>
| gerbil | git@github.com:drewc/gerbil.git (fetch)         |
| gerbil | git@github.com:drewc/gerbil.git (push)          |
| origin | git@github.com:drewc/state-channels.git (fetch) |
| origin | git@github.com:drewc/state-channels.git (push)  |

#+begin_src bash :session refactor-shell
  git branch -a | cat
#+end_src
| *                     | main |
| remotes/gerbil/debian |      |
| remotes/gerbil/errorf |      |
| remotes/gerbil/master |      |
| remotes/gerbil/xenial |      |
| origin/main           |      |
| remotes/origin/main   |      |

 Ok, we'll add a =gerbil= branch that mirrors the upstream.

 #+begin_src bash :session refactor-shell
   git fetch gerbil
 #+end_src

 #+RESULTS:
 : Enter passphrase for key '/home/drewc/.ssh/id_rsa':

 #+begin_src bash
   cd ../..
   git stash
   git checkout --orphan gerbil
   git rm -rf .
   git clean -fdx
   echo foo > bar.baz
   git add .
   git commit -m "fake branch"
   git branch -u gerbil/master
 #+end_src

 We now have a commit to delete at some point

 #+begin_src sh
   git pull --rebase
   git log -1 --pretty --oneline
   # => # 9a427d58 (HEAD -> gerbil) fake branch
   git reset --soft HEAD~1
   git log -1 --pretty --oneline
   # 5741b45e (HEAD -> gerbil, gerbil/master) Merge branch 'vyzo:master' into master
 #+end_src

 Awesome, we now have a gerbil branch

 #+begin_src sh
   git checkout main
 #+end_src

